[
  {
    "title": "Pininfarina",
    "subtitle": "Un progetto sviluppato in team",
    "description": "**Il nostro cliente**: Pininfarina è un’azienda italiana fondata a Torino nel 1930 come società anonima Carrozzeria Pinin Farina da Battista Farina. Le sue attività si concentrano sul design e sulla progettazione e realizzazione di vetture uniche o in piccolissima serie. \n\n**La sfida**: Richiesta di un gestionale profilato che permetta di raccogliere le proposte di fatturazione dei fornitori esterni, consuntivazione ore dei dipendenti interni e gestione di clienti e preventivi. \n\n**La soluzione**: Realizzazione di un portale dinamico basato sulla profilazione utente, sviluppato con React a frontend e Java a backend per soddisfare al meglio le richieste del cliente mantenendo un design moderno ma funzionale.",
    "imgCarousel": "https://cdn.pixabay.com/photo/2016/11/07/13/04/yoga-1805784_960_720.png",
    "colorBg": "#fff",
    "permalink": "1"
  },
  {
    "title": "Youthquake",
    "subtitle": "Un progetto sviluppato in team",
    "description": "**Il nostro cliente**: Youthquake è un’agenzia di data-driven marketing con sedi a Milano e a Londra specializzata nello sviluppo di strategie di marketing, design e sviluppo web. Viene utilizzato un approccio basato sulla raccolta e analisi dei dati per ottenere una migliore comprensione delle esigenze, dei modelli comportamentali e degli interessi dei consumatori. \n\n**La sfida**: creazione un’applicazione internazionale capace di integrarsi senza soluzione di continuità con i sistemi già adottati in grado di offrire la possibilità sia al singolo sia alle agenzie-viaggi di personalizzare e rendere più sicura ogni esperienza di viaggio aereo e non, tramite l’acquisto delle offerte di partners. \n\n**La soluzione**: realizzazione di un’applicazione web in grado di sfruttare le risorse messe a disposizione da Youthquake per creare una nuova interfaccia e nuove funzionalità che consentano ad ogni utente di avere una visione chiara delle offerte e di procedere all’acquisto in sicurezza. L’applicazione è personalizzabile da parte del cliente finale grazie alla realizzazione di un CMS che consente di modificare ogni pagina dell’applicativo, i prodotti offerti e tutti gli utenti e partners.",
    "imgCarousel": "https://cdn.pixabay.com/photo/2020/06/24/05/23/tree-5334773_960_720.png",
    "colorBg": "#D3D3D3",
    "permalink": "2" 
  }
]