[
  {
    "id": 0,
    "cover_img": "",
    "title": "Vtex",
    "subtitle": "Un modo nuovo per creare e-commerce performanti.",
    "description": "Spesso quando ci capita di fare acquisti usiamo il potere di internet per cercare ciò di cui abbiamo bisogno. Amazon, Ebay e Subito sono solo alcuni dei numerosi e-commerce con cui entriamo in contatto quasi tutti i giorni. Ma cos’è un e-commerce ? E come si fa a crearlo? \nPer e-commerce si intende il processo di vendita o acquisto di beni e servizi attraverso il web. In tutto e per tutto un negozio virtuale!  \n    \nPer crearne uno ecco che entra in scena Vtex! Vtex è un e-commerce accelerator, ovvero una piattaforma che permette di costruire, attraverso una serie di strumenti, un e-commerce completo di ogni funzionalità in modo rapido.  \n    \nDal punto di vista pratico la creazione di pagine con Vtex avviene attraverso dei file con estensione .jsonc: una pagina del sito corrisponde ad un file *.jsonc* il quale contiene a sua volta i componenti che costituiscono la pagina, come per esempio l’header, il titolo, le immagini, etc. Questi componenti sono anche detti blocchi e si dividono in due macro categorie: \n- componenti preconfigurati; \n- componenti custom.   \n    \nI primi sono già offerti da vtex, al programmatore basta quindi richiamare il blocco scelto all’interno del file e personalizzarlo a proprio piacimento. Questo avviene grazie alle numerose “props” ovvero proprietà che permettono la modifica del componente preconfigurato. Questo tipo di blocco permette di risparmiare tempo prezioso sugli sviluppi e quindi di creare componenti del sito anche complessi in pochi istanti. Qualora i blocchi messi a disposizione non fossero sufficienti, è possibile creare, a partire da template, i cosiddetti blocchi custom. Questi blocchi utilizzano le tecnologie di React e Typescript per quanto riguarda il front-end in modo da non avere limiti nella personalizzazione del sito. I dati invece possono essere ottenuti dal back-end sia con le chiamate REST classiche, sia tramite GraphQL. Con la fusione di questi due tipi di blocchi si ottiene dunque l’insieme delle pagine che formano il sito, anche detto *tema*.  \n    \nTra i tools che Vtex mette a disposizione, troviamo:  \n    \n- Workspace; \n- CMS; \n- CLI.  \n    \nIl concetto di workspace è strettamente legato al concetto di cloud. Infatti una workspace è uno spazio di lavoro isolato e salvato in un server che rappresenta il codice presente in locale. Per accedervi vtex mette a disposizione un URL fruibile solo da autorizzati, in questo modo è possibile modificare il sito, testarlo, eliminare o aggiungere blocchi senza avere ripercussioni in produzione. In realtà il sito in produzione è anch’esso uno spazio di lavoro. Quando sono necessari bugfix oppure nuove feature bisogna quindi passare da lui.  \n    \nPer creare una workspace, spostarsi da una workspace all’altra e per collegare il codice c’è bisogno della CLI vtex: una serie di comandi usabili nel terminale di qualsiasi sistema operativo per compiere varie operazioni molto importanti, tra cui quelle con gli spazi di lavoro. Anche per rilasciare feature o fix in produzione si utilizzano comandi appositi, così come aggiornare il sito oppure installare blocchi custom. I comandi hanno tutti la stessa sintassi: prefisso vtex seguito dall’operazione che si vuole compiere, per esempio install e infine eventuali opzioni per specificare meglio l’operazione.  \n    \nInfine un altro grande punto di forza di Vtex risiede nel CMS: il CMS o Content Management System è un tool che permette di modificare, eliminare o creare nuovi blocchi all’interno del sito. Rende la modifica dei contenuti anche da parte dei non programmatori, attraverso un’interfaccia intuitiva. Questo si traduce con cambiamenti rapidi del sito, piccoli o grandi che siano, ed effettuabili da chiunque.  \n    \nVtex non è esente da punti deboli, come per esempio la difficoltà di personalizzare più del necessario i blocchi preconfigurati, o la suddivisione del checkout rispetto al resto del codice e il non utilizzo di tecnologie recenti ( React e TypeScript ) per questa sezione. \nIn conclusione Vtex è una piattaforma che permette di creare un sito in modo completo e più rapido rispetto ad altre soluzioni. Rappresenta quindi un’ottima alternativa quando tempo e completezza sono due parole chiave se si vuole creare il proprio e-commerce.",
    "postedBy": " Lorenzo Ienzi",
    "posted": "04/04/22",
    "permalink": "Vtex-0",
    "images": [
      ""
    ]
  },
  {
    "id": 1,
    "cover_img": "",
    "title": "Gamification",
    "subtitle": "Gamification tra gioco e realtà",
    "description": "La “Gamification” è un concetto che si sta diffondendo molto velocemente e che in pochi anni sarà ampiamente diffuso in tutti i dipartimenti di marketing e non solo.  \n    \nMa cos’è veramente la **gamification**?  \n    \nMolte persone credono che la gamification consista nell’utilizzo di videogiochi o minigames al file di pubblicizzare il proprio prodotto, ma in realtà è un concetto molto più complesso.  \n    \nLa gamification consiste nell’inserire in un contesto non ludico alcuni elementi tipici del gioco, ed in particolare del videogioco, con l’obiettivo di coinvolgere gli utenti, che siano clienti, impiegati, partner, etc.  \n    \nAlcuni esempi in cui possiamo trovare applicate tecniche di gamification sono: e-commerce, app di fitness e siti web. Non si deve però commettere l’errore di pensare che la gamification sia riservata esclusivamente ad attività digitali.  \n    \nAnche una tessera punti dove viene applicato un timbro ogni volta che si va a prendere il caffè in un determinato bar è considerato gamification. \nQuesto non solo invoglierà il cliente a ritornare nel bar per completare la scheda e ricevere un caffè gratis ma fornirà anche un feedback immediato al proprietario riguardo l’andamento della propria attività.  \n    \nQuesta strategia si fonda sulla nostra naturale inclinazione a voler raggiungere un obiettivo. La gamification sfrutta gli elementi di gioco, ai quali le nostre menti sono molto ricettive, per far compiere azioni agli utenti.  \n    \nAlcuni degli strumenti tipici della gamification sono: \n- Premi e Badge: sono indicatori sociali di realizzazione o padronanza di un’abilità e spingono gli utenti di un gruppo o di una community alla competizione. \n- Esperienza e Livelli: riguardano il passaggio ad una fase successiva ed un avvicinamento al raggiungimento di un obiettivo. Sapere infatti che il prossimo “level up” è proprio dietro l’angolo è un fortissimo strumento motivazionale. \n- Classifica: nasce con l’obiettivo di incentivare gli utenti a continuare ad utilizzare un prodotto/servizio mostrandogli i progressi degli altri utenti. Le classifiche devono essere strutturate in modo tale da incoraggiare i giocatori a rimanere, senza disincentivare i giocatori meno competitivi. \n- Obiettivi: sono in grado di indirizzare il comportamento dell’utente, mostrandogli quali azioni compiere e ricompensandoli quando sono state compiute.  \n    \nLa ricompensa deve essere proporzionata alla difficoltà dell’obiettivo: se questa è di poco valore, l’utente non sarà incentivato a raggiungere l’obiettivo, mentre se il valore è troppo elevato, l’utente tenderà ad attribuire meno importanza al premio ricevuto.  \n    \nL’applicazione della gamification è una questione di equilibrio. Aggiungendo troppi elementi di gioco potremmo distrarre l’utente dal nostro obiettivo finale (ad esempio la vendita di un prodotto), mentre inserendone un numero troppo basso renderemmo la nostra applicazione poco coinvolgente. Bisogna far sì che gli elementi di gioco accompagnino l’utente durante l’esperienza sulla nostra piattaforma.  \n    \nPerché la gamification funziona?  \n    \nLe tecniche di gamification non hanno solo l’obiettivo di coinvolgere maggiormente l’utente, ma anche si creare awareness, ossia fanno sì che il tuo brand sia riconoscibile nella mente degli utenti e che sia considerato una, se non la prima, tra le possibili scelte nella fase di acquisto.  \n    \nLa gamification ha il potere di fidelizzare. Quanto un utente si aggiudica un premio, ottiene un badge o sale in classifica, la sua mente rilascia dopamina e tutto ciò genera un senso di soddisfazione difficilmente ricreabile con altre strategie.  \n    \nGenera competizione tra gli utenti: l’uomo è per sua natura un essere competitivo e attraverso i videogiochi questa caratteristica si accentua ancora di più. Creare un’energia competitiva attraverso classifiche, barre di progresso, badge e sistemi a punti non solo divertirà gli utenti ma sarà in grado di coinvolgerli ad un livello più profondo.  \n    \nInfine, la gamification consente di raccogliere molte informazioni come nomi, e-mail, preferenze personali, tassi di ritorno e percentuali di successo, i quali hanno un enorme valore a livello di marketing.  \n    \nCome posso implementare la gamification?  \n    \nStudia l’utilizzatore finale. Dopo aver individuato il target di riferimento, studia quali sono le leve motivazionali che lo spingono a scegliere il tuo prodotto e, successivamente, trova le meccaniche che agiscono su quelle leve. Se ad esempio il mio prodotto è destinato a persone che praticano molto sport, è probabile che agire sulla competizione possa essere una scelta saggia.  \n    \nRealizza programmi fedeltà. Fornire ricompense ed incentivi al di fuori delle competizioni di gioco è molto importante.  \n    \nUn esempio è rappresentato dal programma fedeltà di Starbucks: ogni volta che acquisti un drink o uno snack tramite app, ti vengono riconosciuti punti che possono essere utilizzati per ottenere dei prodotti gratis.  \n    \nInserisci degli elementi di competizione e incoraggia gli utenti ad invitare i propri amici. Che sia attraverso una promozione o un codice “invita un amico”, la gamification incentiva gli utenti a parlare del tuo brand con altre persone. La componente di condivisione crea un’immagine positiva dell’azienda e consente di attirare nuovi clienti.  \n    \nSviluppa collaborazioni con altri brand. Ad esempio, organizzare un “give away” in collaborazione con un’altra azienda sfruttando le dinamiche di gioco, può rivelarsi un’idea vincente. Nel caso di Resmed, che voleva raccogliere informazioni sul tema dell’apnea notturna e altri disordini del sonno, la collaborazione con l’azienda di materassi Koala Mattresses è stata un’ottima idea. Le aziende hanno realizzato un videogame ed hanno messo in palio cuscini e un letto come premio finale. Molti utenti non solo hanno giocato più volte per vincere il premio, ma hanno anche compilato un test sull’apnea, che era l’obiettivo principale di Resmed.  \n    \nInserisci elementi a tempo. La “FOMO” o “Fear of Missing Out”, è la paura di perdersi qualcosa, inserire elementi come timer o promozioni dalla durata limitata, spingerà l’utente ad acquistare un determinato prodotto.  \n    \nInsomma, di tecniche di gamification ne esistono veramente tante. La cosa importante è cercare di mantenere il focus sul prodotto e ricordarsi che il fine ultimo della nostra piattaforma non è far divertire l’utente ma aumentarne il coinvolgimento.  \n    \nAlcuni consigli utili  \n    \nTieni gli utenti attivi. Grazie alla gamification è facile realizzare un rapporto di lungo termine, per esempio tramite sfide giornaliere. Questo incoraggerà gli utenti a visitare ripetutamente l’applicazione o il sito e li coinvolgerà ancora di più.  \n    \nOffri uno svago agli utenti. Oggi le persone conducono vite frenetiche e non è facile catturare la loro attenzione. Grazie alla gamification è possibile distinguersi dai competitor, poiché fornisce un motivo per prendersi una pausa, ossia divertirsi. I giochi intrattengono gli utenti, consentono di vivere nuove avventure e di trionfare.  \n    \nGenera un passaparola. Il cosiddetto “Word of Mouth” o passaparola, diventa fondamentale per generare awareness. Quando le persone trovano qualcosa di divertente, il loro primo istinto è quello di raccontarlo ai propri amici. Al giorno d’oggi siamo tutti interconnessi grazie ai social, per cui è importante utilizzare queste piattaforme per promuovere il proprio prodotto.  \n    \nUtilizza più piattaforme. Non è più immaginabile diffondere una campagna marketing su un solo canale. Le persone possono entrare in contatto con il prodotto nei modi più disparati, è importante quindi adattare le tecniche di gamification ad ogni tipologia di piattaforma, in modo da ottenere una copertura illimitata della campagna.  \n    \nPerché utilizzare la gamification?  \n    \nSe quanto detto finora non ti avesse ancora convinto dell’efficacia della gamification, ecco altri 2 motivi fondamentali per i quali dovresti utilizzarla:  \n    \n1. - La portata di mercato. Contrariamente a quello che si pensa, i videogame raggiungono un target senza limiti di età. Infatti, con l’avvento degli smartphone, non è raro vedere persone anziane o bambini piccoli giocare con il proprio dispositivo. Rispetto a qualche anno fa quindi, le tecniche di gamification hanno la potenzialità di raggiungere chiunque. \n2. - È economica. La parte più dispendiosa di una strategia di gamification è l’analisi del mercato e l’ideazione delle tecniche più adeguate al settore di riferimento. Se però si ha a disposizione un budget limitato, è possibile analizzare alcuni dei tantissimi casi studio presenti sul web e prendere spunto da quello che più si adatta al proprio obiettivo.  \n    \nConclusioni  \n    \nGrazie all’individuazione delle meccaniche che fanno leva sulle motivazioni dei consumatori, è possibile utilizzare le tecniche di gamification per ottenere un maggiore coinvolgimento degli utenti, rafforzare la loro soddisfazione, incrementare le vendite e soprattutto distinguersi dalla concorrenza",
    "postedBy": "Luca Pignorio",
    "posted": "04/04/22",
    "permalink": "gamification-1",
    "images": [
      ""
    ]
  }
]